src/cf/Documents/ор_ПриоритетнаяПоставка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ор_ПриоритетнаяПоставка</Name>
			<Comment>Договор о приоритетной поставке</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ор_ДоговораПриоритетныхПоставок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ор_ПриоритетнаяПоставка/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ор_ПриоритетнаяПоставка - документ для инициализации.
//  ДополнительныеСвойства - Структура - дополнительные свойства выполнения операции.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Приоритет КАК Приоритет,
	|	Запасы.Ссылка.Контрагент КАК Контрагент,
	|	Запасы.Ссылка.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.ор_ПриоритетнаяПоставка.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("Таблицаор_ДоговораПриоритетныхПоставок", Результат.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Печать договора форма списка.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор                  = "ДоговорОПоставке";
	КомандаПечати.Представление                  = НСтр("ru = 'Договор о приоритетной поставке'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок                        = 0;
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорОПоставке") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорОПоставке",
			НСтр("ru = 'Договор о поставках'"),
			ПечатьНакладная(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует печатную форму документа.
//
Функция ПечатьНакладная(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДоговорОПоставке";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ор_ПриоритетнаяПоставка.ПФ_MXL_ДоговорОПоставке");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокументов.Номенклатура,
	|	ТаблицаДокументов.Приоритет,
	|	ТаблицаДокументов.Ссылка.Контрагент,
	|	ТаблицаДокументов.Ссылка.Организация,
	|	КОНЕЦПЕРИОДА(ТаблицаДокументов.Ссылка.ДатаОкончания, ДЕНЬ) КАК Поле1,
	|	ТаблицаДокументов.Ссылка.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.Ссылка.Номер,
	|	ТаблицаДокументов.Ссылка.Дата,
	|	ТаблицаДокументов.НомерСтроки
	|ИЗ
	|	Документ.ор_ПриоритетнаяПоставка.Запасы КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок   = Макет.ПолучитьОбласть("Заголовок");
	Шапка              = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары      = Макет.ПолучитьОбласть("Товары");
	ОбластьИтог        = Макет.ПолучитьОбласть("Итог");
	ОбластьПодписи     = Макет.ПолучитьОбласть("Подписи");
	
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Договор о приоритетных поставках №%1 от %2'"),
		МассивОбъектов[0].Номер,
		МассивОбъектов[0].Дата);
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок,
		МассивОбъектов[0].Ссылка);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Шапка.Параметры.Организация   = МассивОбъектов[0].Организация;
	Шапка.Параметры.Контрагент    = МассивОбъектов[0].Контрагент;
	Шапка.Параметры.ДатаОкончания = МассивОбъектов[0].ДатаОкончания;
	ТабличныйДокумент.Вывести(Шапка);
	
	ТабличныйДокумент.Вывести(ОбластьТоварыШапка);
	Пока Выборка.Следующий() Цикл
		ОбластьТовары.Параметры.НомерСтроки  = Выборка.НомерСтроки;
		ОбластьТовары.Параметры.Номенклатура = Выборка.Номенклатура;
		ОбластьТовары.Параметры.Приоритет    = Выборка.Приоритет;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ТабличныйДокумент.Вывести(ОбластьТовары);
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьИтог);
	
	ТекстИтоговойСтроки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Всего наименований %1'"), ОбластьТовары.Параметры.НомерСтроки);
	ОбластьПодписи.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;
	ТабличныйДокумент.Вывести(ОбластьПодписи);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	
	Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
